title: 基于DCC2凭证获取
description: windows server 2008 模拟测试结果
references: https://baijiahao.baidu.com/s?id=1611304657392579351
tags: T1003
status: experimental
author: 12306Bro
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 4688  # 进程创建
        NewProcessname: '*\mimikatz.exe' #新进程名称
        Tokenpromotiontype: 'TokenElevationTypeFull (2)' #令牌提升类型
    selection2:
        EventID: 4673  #已调用特权服务。
        Processname: '*\mimikatz.exe' #进程>进程名称
        Privilege: 'SeTcbPrivilege'  #服务请求信息>特权：SeTcbPrivilege
    timeframe: last 5s  
    condition: all of them
level: medium