title: windows本地执行reg query HKEY_CURRENT_USER\Software\Microsoft\Terminal Server Client\Default
description: windows server 2016
references: 
        - https://github.com/redcanaryco/atomic-red-team/blob/910a2a764a66b0905065d8bdedb04b37049a85db/atomics/T1012/T1012.md
tags: T1012
status: experimental
author: 12306Bro
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4688 #进程创建
        Newprocessname: 'C:\Windows\System32\reg.exe' #进程信息>新进程名称
        Creatorprocessname: 'C:\Windows\System32\cmd.exe' #进程信息>创建者进程名称
        Processcommandline: 
                 - reg query "HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows"
                 - reg query HKLM\Software\Microsoft\Windows\CurrentVersion\RunServicesOnce
                 - reg query HKCU\Software\Microsoft\Windows\CurrentVersion\RunServicesOnce
                 - reg query HKLM\Software\Microsoft\Windows\CurrentVersion\RunServices
                 - reg query HKCU\Software\Microsoft\Windows\CurrentVersion\RunServices
                 - reg query "HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\Notify"
                 - reg query "HKLM\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\Userinit"
                 - reg query "HKCU\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\\Shell"
                 - reg query "HKLM\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\\Shell"
                 - reg query HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\ShellServiceObjectDelayLoad
                 - reg query HKLM\Software\Microsoft\Windows\CurrentVersion\RunOnce
                 - reg query HKLM\Software\Microsoft\Windows\CurrentVersion\RunOnceEx
                 - reg query HKLM\Software\Microsoft\Windows\CurrentVersion\Run
                 - reg query HKCU\Software\Microsoft\Windows\CurrentVersion\Run
                 - reg query HKCU\Software\Microsoft\Windows\CurrentVersion\RunOnce
                 - reg query HKLM\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run
                 - reg query HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run
                 - reg query HKLM\system\currentcontrolset\services /s | findstr ImagePath 2>nul | findstr /Ri ".*\.sys$"
                 - reg query HKLM\Software\Microsoft\Windows\CurrentVersion\Run
         #进程信息>进程命令行，实际情况下，你可以对任何注册表查询行为进行检测
    condition: selection
level: low