title: win_远程powershell会话
description: windows server 2016
tags: T1021-006
status: experimental
author: 12306Bro
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 4688 #已创建新的进程。
        Newprocessname: 'C:\Windows\System32\dllhost.exe' #新进程名称
        Creatorprocessname: 'C:\Windows\System32\svchost.exe' #创建者进程名称
    selection2:
        EventID: 4688 #已创建新的进程。
        Newprocessname: 'C:\Windows\System32\wsmprovhost.exe' #新进程名称
        Creatorprocessname: 'C:\Windows\System32\svchost.exe' #创建者进程名称
        Processcommandline: 'C:\Windows\system32\wsmprovhost.exe -Embedding' #进程命令行参数
    timeframe: last 2s
    condition: selection
level: medium