title: AD域权限组及用户枚举
description: win7测试，windows service 2008（域控）
references: http://www.polaris-lab.com/index.php/archives/42/
tags: T1087/T1069
status: experimental
author: 12306Bro
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4661  # 已请求到对象的句柄
        Objecttype:  #对象>对象类型
             - SAM_USER
             - SAM_GROUP
        Objectname: #对象>对象名
             - 'S-1-5-21-*-*-*-502'
             - 'S-1-5-21-*-*-*-512'
             - 'S-1-5-21-*-*-*-500'
             - 'S-1-5-21-*-*-*-505'
             - 'S-1-5-21-*-*-*-519'
             - 'S-1-5-21-*-*-*-520'
             - 'S-1-5-21-*-*-*-544'
             - 'S-1-5-21-*-*-*-551'
             - 'S-1-5-21-*-*-*-555'
        Processname: 'C:\Windows\System32\lsass.exe' #进程信息>进程名称
    condition: selection
level: medium