title: 添加用户到本地组
description: 此规则触发添加到本地Administrators组的用户帐户，这可能是合法活动或特权升级活动的标志。
status: stable
author: 12306Br0(测试+翻译)
date: 2020/06/08
tags:
    - attack.privilege_escalation
    - attack.t1078
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4732
    selection_group1:
        GroupName: 'Administrators' #组名
    selection_group2:
        GroupSid: 'S-1-5-32-544'
    filter:
        SubjectUserName: '*$'
    condition: selection and (1 of selection_group*) and not filter
falsepositives:
    - 合法用户活动
level: medium