title: 从单一源系统使用不同帐户登录失败
description: 从单个源系统检测使用不同用户帐户的可疑失败登录
author: 12306Br0（翻译）
date: 2020/06/09
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1078-003
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID:
            - 529 #windows 2003
            - 4625 #windows server 2008以上
        UserName: '*'  #用户名
        WorkstationName: '*'  #工作站名
    selection2:
        EventID: 4776 #适用于域账户登录
        UserName: '*' #用户名
        Workstation: '*' #工作站名
    timeframe: 24h
    condition:
        - selection1 | count(UserName) by WorkstationName > 3
        - selection2 | count(UserName) by Workstation > 3
falsepositives:
    - 终端服务器
    - 跳板服务器
    - 其他多用户系统，例如Citrix服务器场
    - 用户频繁变化的工作站
level: medium