title: 在windows文件和目录发现
description: windows server 2016
tags: T1083
status: experimental
author: 12306Bro
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4688 #已创建新的进程。
        Newprocessname: 'C:\windows\system32\tree.com' #进程信息>进程名称
        Creatorprocessname: 'C:\windows\system32\cmd.exe' #进程信息>创建者进程名称
        Processcommandline: tree #进程信息>进程命令行
    condition: selection
level: medium