title: MS14-068-PYKEK
description: windows server 2008 / windows 7
references: https://github.com/ThreatHuntingProject/ThreatHunting/blob/master/hunts/golden_ticket.md
tags: T1097
status: experimental
author: 12306Bro
logsource:
    product: windows
    service: Security
detection:
    selection1:
        EventID: 4624 #账户登录
        Account Domain: '*.*' #新登录>账户域(正常情况下，账户域应为ABC，当存在PYKEK攻击时，账户域为ABC.COM)
        Account Name: '*' #新登录>账户名(不同于安全标识的帐户，此条件实现起来较为复杂)
    selection2:
        EventID: 4672 #管理员登录
        Account Domain: '*.*' #账户域(正常情况下，账户域应为ABC，当存在PYKEK攻击时，账户域为ABC.COM)
    selection3:
        EventID: 4768 #Kerberos TGS请求
        Supplied Realm Name: '*.*' #已提供的领域名称(正常情况下，已提供的领域名称应为ABC，当存在PYKEK攻击时，已提供的领域名称为ABC.COM)
    timeframe: last 5s
    condition: all of them
level: medium