title: Hydra win7 RDP爆破
description: kali windows hydra
references: https://www.96007.club/2019/09/17/Credential-Access-win-Password-spraying/
tags: T1110
status: experimental
author: Blue team
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 4776 #计算机试图验证帐户的凭据。
        AuthenticationPackage: 'MICROSOFT_AUTHENTICATION_PACKAGE_V1_0'
        LogonAccount: '*'
        SourceWorkstation: '*'
        ErrorCode: '0xc0000064'
    selection2:
        EventID: 4625
        LogonType: 3
        FailureReason: '未知用户名或密码错误。' #失败信息>失败原因
        Status: 0xc000006d   #失败信息>状态
        SubStatus: 0xc0000064  #失败信息>子状态
        LogonProcess: 'NtLmSsp' #详细的身份验证信息>登陆进程
        AuthenticationPackage: 'NTLM' #详细的身份验证信息>身份验证包
    timeframe: last 2s
    condition: all of them
level: medium
#注意：在一分钟内，同一主机事件ID为4625的事件大于50个；