title: 通达OA v11.6 RCE
description: 检测通达OA v11.6 RCE漏洞
author: 12306Bro
date: 2020/08/19
status: experimental
references:
    - https://www.cnblogs.com/L0ading/p/13529013.html
logsource:
    category: webserver
detection:
    selection1:
        c-uri:
            - '//module/appbuilder/assets/print.php?guid=../../../webroot/inc/auth.inc.php' #响应包状态码为200
            - '//inc/auth.inc.php' #响应包状态码为404，意味着删除成功
        http.request.method: 'GET' #请求方法为GET
        User-Agent: 'python-requests/*' #PY脚本自带
    selection2:
        c-uri: 
            - '//general/data_center/utils/upload.php?action=upload&filetype=nmsl&repkid=/.%3C%3E./.%3C%3E./.%3C%3E./' #响应包状态码为200
        http.request.method: 'POST' #请求方法为POST
        User-Agent: 'python-requests/*' #PY脚本自带
        Content-Disposition: form-data; name="FILE1"; filename="*.php" #写入shell文件
    condition: selection1 or selection2 #当条件1和条件2出现任意一个时，意味着你可能正在遭受探测性攻击，如果在短时间内出现了条件1后，出现了条件2，并且返回包状态码为200，意味着攻击正在发生，可能入侵成功。
falsepositives:
    - Unknown
level: critical