title: MS14-068-PYKEK
description: windows server 2008 / windows 7
references: https://www.blackhat.com/docs/us-15/materials/us-15-Metcalf-Red-Vs-Blue-Modern-Active-Directory-Attacks-Detection-And-Protection-wp.pdf
tags: T1212
status: experimental
author: 12306Bro
logsource:
    product: windows
    service: Security
detection:
    selection1:
        EventID: 4624 #账户登录
        Account Domain: '*.*' #新登录>账户域(正常情况下，账户域应为ABC，当存在KEKEO攻击时，账户域为ABC.COM)
    selection2:
        EventID: 4672 #管理员登录
        Account Domain:  #账户域(正常情况下，账户域应为ABC，当存在KEKEO攻击时，账户域为空)
    selection3:
        EventID: 4768 #Kerberos TGS请求
        Supplied Realm Name: '*.*' #已提供的领域名称(正常情况下，已提供的领域名称应为ABC，当存在KEKEO攻击时，已提供的领域名称为ABC.COM)
    timeframe: last 5s
    condition: all of them
level: medium