title: Microsoft Compiler
status: experimental
description: 检测Microsoft工作流编译器的调用，该编译器可能允许执行任意无符号代码
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
references:
    - https://posts.specterops.io/arbitrary-unsigned-code-execution-vector-in-microsoft-workflow-compiler-exe-3d9294bc5efb
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\Microsoft.Workflow.Compiler.exe'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate MWC use (unlikely in modern enterprise environments)
level: high