title: windows本地执行netsh advfirewall firewall show rule name=all
description: windows server 2016
references: 暂无
tags: T1518-001
status: experimental
author: 12306Bro
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4688 #进程创建
        Newprocessname: 'C:\Windows\System32\netsh.exe' #进程信息>新进程名称
        Creatorprocessname: 'C:\windows\System32\cmd.exe' #进程信息>创建者进程名称
        Processcommandline: netsh  advfirewall firewall show rule name=all  #进程信息>进程命令行
    condition: selection
level: low