action: global
title: Invoke-Obfuscation Via Use Rundll32
id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
status: experimental
author: Nikita Nazarov, oscd.community
date: 2020/10/09
modified: 2021/08/09
references:
    - https://github.com/Neo23x0/sigma/issues/1009 #(Task30)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
falsepositives:
    - Unknown
level: high
detection:
    selection:
        ImagePath|re: '(?i).*&&.*rundll32.*shell32\.dll.*shellexec_rundll.*(value|invoke|comspec|iex).*"'
    condition: selection and selection_eventid
logsource:
    product: windows
    service: system

