action: global
title: InvisiMole Wrapper DLL Loaded
id: 82880fba-a624-4fff-841f-feae655a6828
status: experimental
description: Detects process activity associated with InvisiMole loader, as reported in 2018
references:
    - https://www.welivesecurity.com/2018/06/07/invisimole-equipped-spyware-undercover/
author: ESET Research
date: 2021/05/17
tags:
    - attack.defense_evasion
    - attack.t1574.001
falsepositives:
    - Unknown
level: high
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - '\Windows\explorer.exe'
            - '\Windows\svchost.exe'
        Image|endswith: '\rundll32.exe'
        CommandLine|contains:
            - '\mpr.dll'
            - '\fxsst.dll'
            - '\winmm.dll'
        CommandLine|endswith: 'GetDataLength'
    condition: selection

