action: global
title: InvisiMole UAC Bypass
id: d0ccbcf8-4d15-425c-b74e-03a857fcd4f1
status: experimental
description: Detects artefacts and process activity associated with UAC bypass technique used by InvisiMole, as reported in June 2020.
references:
    - https://www.welivesecurity.com/2020/06/18/digging-up-invisimole-hidden-arsenal/
author: ESET Research
date: 2021/05/17
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1548.002
    - attack.t1202
falsepositives:
    - Unknown
level: high
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        sha1:
            - '9fdb5b3311ba5b61ff9008469dbaff271c29fa51'
            - '4a6dc6a32a777dc5dd47221bf79604bc0258a987'
        Image|endswith:
            - 'kb043921.exe'
            - 'winapiexec.exe'
            - 'winapiexec64.exe'
    cmdline:
        CommandLine|contains:
            - '\Microsoft\Installer\kb043921.exe'
            - 'OpenFileMappingW'
            - 'XVD21x9DC'
    parent:
        ParentImage|endswith:
            - '\fodhelper.exe'
            - '\CompMgmtLauncher.exe'
    condition: selection and (cmdline or parent)